**Chapter 17 17.1 Exercise**

* Use sqlite3 to connect to book database
* Use pandas to display all the authors in decending order
* Use pandas to display the book titles in ascending order
* Use pandas and INNER JOIN to display a specific author's books including the books title, copyright year, and ISBN. Order the information alphabetically by title
* Create a cursor object to: add and author and add a new for book that author including the title, isbn, edition, and copyright year. Information should be linked across all tables

In [2]:
import sqlite3

In [3]:
connection = sqlite3.connect('books.db')

In [4]:
import pandas as pd

select all authors last names from authors table in decending order

In [6]:
pd.read_sql('SELECT last FROM authors ORDER BY last DESC', connection)

     last
0    Wald
1   Quirk
2  Deitel
3  Deitel
4  Deitel

select all book titles from titles table in ascending order

In [7]:
pd.read_sql('SELECT title FROM titles ORDER BY title ASC', connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

Use INNER JOIN to select all books for specific author. Include title, copyright year, and ISBN and organize alphabetically by title.

* Select all the info I want to show. Use the name of the chart and what I want from it example: authors.first
* Join the author_ISBN table with the titles table to connect the isbn from both tables
* Join the authors table next to connect the id from the authors table and the authors ISBN table
* Select which author to show using WHERE- I am choosing Paul Deitel.
* Use Group BY to group the titles based on the isbn, title, and copyright year
* Order the output based on the title

In [22]:
pd.read_sql("""SELECT  authors.first, authors.last, titles.isbn, titles.title, titles.copyright FROM titles INNER JOIN 
author_ISBN ON titles.isbn = author_ISBN.isbn INNER JOIN authors ON authors.id = author_ISBN.id
WHERE authors.last = 'Deitel' GROUP BY titles.isbn, titles.title, titles.copyright ORDER BY titles.title""", connection)

  first    last        isbn                             title copyright
0  Paul  Deitel  0134289366         Android 6 for Programmers      2016
1  Paul  Deitel  0134444302            Android How to Program      2017
2  Paul  Deitel  0133976890                  C How to Program      2016
3  Paul  Deitel  0134448235                C++ How to Program      2017
4  Paul  Deitel  0132151006     Internet & WWW How to Program      2012
5  Paul  Deitel  0135404673     Intro to Python for CS and DS      2020
6  Paul  Deitel  0134743350               Java How to Program      2018
7  Paul  Deitel  0133406954  Visual Basic 2012 How to Program      2014
8  Paul  Deitel  0134601548          Visual C# How to Program      2017
9  Paul  Deitel  0136151574         Visual C++ How to Program      2008

Insert a new author into the authors table
* Create cursor object
* Call the cursor method execute
* Use INSERT INTO statement to add a new author into the authors table
* confirm the author was added

In [26]:
cursor = connection.cursor()

cursor = cursor.execute("""INSERT INTO authors (first, last) VALUES ('Lauren', 'Roberts')""")

pd.read_sql('SELECT id, first, last FROM authors', connection, index_col=[

        first     last
id
1        Paul   Deitel
2      Harvey   Deitel
3       Abbey   Deitel
4         Dan    Quirk
5   Alexander     Wald
8      Lauren  Roberts

Insert a new title for an author. Book must have entry in author_ISBN and titles table
* Use INSERT INTO to add a new book title with values of isbn, title, edition, and copyright
* Link the title and author by using INSERT INTO in author_ISBN with the values of the author id and the isbn
* Use panda to show books written by new author

In [29]:
cursor = cursor.execute("""INSERT INTO titles(isbn, title, edition, copyright)
VALUES('123456789', 'Powerless', 1, 2023)""")

cursor = cursor.execute("""INSERT INTO author_ISBN (id, isbn) VALUES (8, 123456789)""")

pd.read_sql("""SELECT  authors.first, authors.last, titles.isbn, titles.title, titles.copyright FROM titles INNER JOIN 
author_ISBN ON titles.isbn = author_ISBN.isbn INNER JOIN authors ON authors.id = author_ISBN.id
WHERE authors.last = 'Roberts' GROUP BY titles.isbn, titles.title, titles.copyright ORDER BY titles.title""", connection)

    first     last       isbn      title copyright
0  Lauren  Roberts  123456789  Powerless      2023